---
type: SharedParameterApplicableRule
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# SharedParameterApplicableRule

`Autodesk.Revit.DB.SharedParameterApplicableRule` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SharedParameterApplicableRule | 2011 | `public SharedParameterApplicableRule ( string parameterName )` |
| Property | ParameterName | 2011 | `public string ParameterName { get ; set ; }` |